# Parameter Type Id Rebar Elem Termination End Orient Property

Source: https://www.revitapidocs.com/2026/132512ca-b230-89a0-3425-8b3e0bcf5c49.htm

---

| Parameter Type Id Rebar Elem Termination End Orient Property |
| --- |

"Orientation At End"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarElemTerminationEndOrient { get; }
```

```
Public Shared ReadOnly Property RebarElemTerminationEndOrient As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarElemTerminationEndOrient {
	ForgeTypeId^ get ();
}
```

```
static member RebarElemTerminationEndOrient : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace